PMo_manipulated/Graphviz/41.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Enter type of\nMachine" -> "Enter serial number\nof machine";
  "Enter serial number\nof machine" -> "Connecting to device";
  "StartNoneEvent" -> "Turn on bluetooth";
  "Turn on bluetooth" -> "Run 'Inspect-App'";
  "Run 'Inspect-App'" -> "Enter type of\nMachine";
  "Connecting to device" -> "Connected?";
  "Connected?" -> "Check the fill\ncapacity" [label="yes"];
  "Check the fill\ncapacity" -> "Is the fill level in\nthe bootle ok?";
  "Save Answers" -> "Press 'Produce'\nbutton";
  "Press 'Produce'\nbutton" -> "Are the right\nbottles in the pack?";
  "Press button 'Abort\nprocess'" -> "ParallelGateway_1";
  "ParallelGateway_1" -> "Auto collect values";
  "ParallelGateway_1" -> "Show data";
  "Show data" -> "ParallelGateway_2";
  "Auto collect values" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "Present results";
  "Present results" -> "EndNoneEvent";
  "Connected?" -> "Run 'Inspect-App'" [label="no"];
  "Are the right\nbottles in the pack?" -> "Press button 'Abort\nprocess'" [label="no"];
  "Is the fill level in\nthe bootle ok?" -> "Leave short Feedback" [label="no"];
  "Leave short Feedback" -> "Press button 'Abort\nprocess'";
  "Is the fill level in\nthe bootle ok?" -> "Is the cap position\nstraight?" [label="yes"];
  "Is the cap position\nstraight?" -> "Save Answers" [label="yes"];
  "Are the right\nbottles in the pack?" -> "Present results" [label="yes"];
  "Auto collect values" -> "EndNoneEvent";

  "StartNoneEvent" [label="", shape=circle];
  "EndNoneEvent" [label="", shape=circle, penwidth=4];
  "Connected?" [shape=diamond];
  "Is the fill level in\nthe bootle ok?" [shape=diamond];
  "Is the cap position\nstraight?" [shape=diamond];
  "Are the right\nbottles in the pack?" [shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
