pmo-dataset/mermaid/41.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	User_2["Enter type of\nMachine"] --> User_3["Enter serial number\nof machine"]
	User_3 --> Service_1["Connecting to device"]
	StartNoneEvent_1((" ")) --> User_1["Turn on bluetooth"]
	User_1 --> User_4["Run 'Inspect-App'"]
	User_4 --> User_2
	Service_1 --> ExclusiveGateway_1{"Connected?"}
	ExclusiveGateway_1 -->|"yes"| User_5["Check the fill\ncapacity"]
	User_5 --> ExclusiveGateway_2{"Is the fill level in\nthe bootle ok?"}
	Service_2["Save Answers"] --> User_7["Press 'Produce'\nbutton"]
	User_7 --> ExclusiveGateway_4{"Are the right\nbottles in the pack?"}
	User_8["Press button 'Abort\nprocess'"] --> ParallelGateway_1{"+"}
	ParallelGateway_1 --> Service_3["Auto collect values"]
	ParallelGateway_1 --> Service_4["Show data"]
	Service_4 --> ParallelGateway_2{"+"}
	Service_3 --> ParallelGateway_2
	ParallelGateway_2 --> Service_5["Present results"]
	Service_5 --> EndNoneEvent_1((" ")):::endEvent
	ExclusiveGateway_1 -->|"no"| User_4
	ExclusiveGateway_3{"Is the cap position\nstraight?"} -->|"no"| User_6["Leave short Feedback"]
	ExclusiveGateway_4 -->|"no"| User_8
	ExclusiveGateway_2 -->|"no"| User_6
	User_6 --> User_8
	ExclusiveGateway_2 -->|"yes"| ExclusiveGateway_3
	ExclusiveGateway_3 -->|"yes"| Service_2
	ExclusiveGateway_4 -->|"yes"| Service_5
